"""Константы сервиса."""


# Справочник порядка фин.таблиц на cib.research
TABLES_HANDBOOK = {0: 'review_table', 1: 'pl_table', 2: 'balance_table', 3: 'money_table'}


# Предложения в отчетах для замены на пустую строку
REPLACE_STMTS = [
    'Полный обзор см. на нашем портале.',
    'Подробнее см. обзор на нашем портале.',
    'Полная версия обзора доступна на нашем портале.',
    'Полная версия обзора доступна на английском языке.',
    'Подробнее см. в опубликованном вчера обзоре.',
    'Подробнее см. в обзоре на нашем портале.',
    'Полный текст обзора доступен на нашем сайте на английском языке.',
]
