sample_of_news_title = '{}\n<i><a href="{}">{}</a></i>\n\n'
sample_of_img_title = '<b>{}</b>\nИсточник: {}\nДанные на <i>{}</i>'
sample_of_img_title_view = '<b>{}\n{}</b>\nДанные на <i>{}</i>'

handbook_prefix = '<b>{}</b>\n\n'
PATH_TO_COMMODITY_GRAPH = 'sources/img/{}_graph.png'

research_footer = 'Источник: Sber Analytical Research. Распространение материалов за пределами Сбербанка запрещено'
giga_ans_footer = 'Ответ сгенерирован Gigachat. Информация требует дополнительной верификации'

SELECTED = '✅'
UNSELECTED = '🟩'
DELETE_CROSS = '❌'
NEXT_PAGE = '➡'
PREV_PAGE = '⬅'
STOP = '⛔'

CANCEL_CALLBACK = 'cancel'

# константы для RAG
default_rag_answer = 'В базе знаний нет ответа на этот вопрос, обратитесь к команде проекта.'
like_feedback = 'Я рад, что вам понравилось!'
dislike_feedback = 'Я буду стараться лучше...'
giga_rag_footer = 'Ответ сгенерирован Gigachat с помощью Базы Знаний. Информация требует дополнительной верификации'
