rag_names = {
    "Общеновостные телеграм-каналы": 'событиях в мире',
    "Финансовые телеграм-каналы": 'экономике',
    "Финансовые институты": 'финансовых институтах',
    "Энергетика": 'энергетике',
    "Недвижимость": 'недвижимости',
    "Торговля": 'торговле',
    "Металлургия": 'металлургии',
    "Сельское хозяйство": 'сельском хозяйстве',
    "Промышленность": 'промышленности',
    "Тмт": 'телекоммуникациях',
    "Транспорт": 'транспортной отрасли',
    "Нефтегаз": 'нефтегазовой отрасли',
}
